{
  "layout": {
    "home": "الصفحه الرئيسيه",
    "all_products": "كل المنتجات",
    "hot_deals": "عروض حصريه",
    "contact_us": "تواصل معنا",
    "market_with_us": "سوق معنا"
  },
  "home": {
    "home_page": "الصفحه الرئيسيه",
    "elevate_your_kitchen_essentials": "ارتقِ بأساسيات مطبخك",
    "shop_our_curated_collection_of_compact_blenders_kettles_toasters_and_more_designed_for_performance_and_style": "تسوق من مجموعتنا المنسقة من الخلاطات المدمجة، والغلايات، ومحامص الخبز والمزيد - المصممة للأداء والأناقة.",
    "shop_by_brand": "تسوق حسب العلامة التجارية",
    "hot_deals": "عروض حصريه"
  },
  "form": {
    "full_name": "الاسم الكامل",
    "enter_your_full_name": "أدخل اسمك الكامل",
    "email": "البريد اللكتروني (اختياري)",
    "enter_your_email": "أدخل بريدك الإلكتروني",
    "country": "دولة",
    "governorate": "محافظة",
    "phone_number": "رقم التليفون",
    "whatsapp_number": "رقم الواتساب",
    "full_address": "العنوان الكامل",
    "enter_your_full_address_here": "أدخل عنوانك الكامل هنا (المنطقه/ المركز / اسم الشارع / رقم العقار)",
    "your_full_address": "عنوانك الكامل",
    "search_for_product": "ابحث عن المنتج...",
    "write_your_review": "اكتب رأيك هنا..."
  },
  "meta": {
    "home": "الرئيسية",
    "all_products": "كل المنتجات",
    "hot_deals": "عروض حصريه",
    "contact_us": "تواصل معنا",
    "page_not_found": "الصفحه غير موجوده",
    "shopping_cart": "عربة التسوق",
    "checkout": "اتمام الشراء",
    "order_summary": "ملخص الطلب",
    "exchange_and_return_policy": "سياسة الاستبدال و الاسترجاع",
    "shipping_policy": "سياسة الشحن",
    "terms_of_use": "شروط الاستخدام"
  },
  "countries_menu": {
    "egypt": "مصر",
    "ksa": "السعوديه"
  },
  "cart": {
    "your_cart_is_currently_empty": "عربة التسوق فارغة حالياً",
    "continue_shopping": "تابع التسوق",
    "total": "المجموع",
    "your_cart": "سلة التسوق الخاصة بك",
    "category": "فئة:",
    "discount": "تخفيض:",
    "available": "متوفر",
    "subtotal": "المجموع الفرعي",
    "shipping": "شحن",
    "including_vat": "شامله ضريبة القيمة المضافة",
    "qty": "كمية:",
    "order_summary": "ملخص الطلب"
  },
  "btn": {
    "checkout_now": "اتمام الشراء الآن",
    "view_cart": "عرض العربة",
    "add_to_cart": "أضف إلى السلة",
    "login_with_google": "تسجيل الدخول باستخدام جوجل",
    "delete": "حذف",
    "checkout": "اتمام الشراء",
    "place_order": "اتمام الطلب",
    "please_wait": "انتظر من فضلك",
    "view_order_summary": "عرض ملخص الطلب",
    "see_more_products": "شاهد المزيد من المنتجات",
    "write_a_review": "اكتب تعليق",
    "send_review": "أرسل رأيك"
  },
  "order_summary": {
    "order_summary": "ملخص الطلب",
    "order_number": "رقم الطلب",
    "price": "السعر",
    "orignal_price": "السعر الأصلي",
    "subtotal": "المجموع الفرعي",
    "savings": "التوفير",
    "total": "الإجمالي",
    "quantity": "الكميه:",
    "no_order_data": "لا توجد طلبات حالياً",
    "shipping": "شحن"
  },
  "toast": {
    "please_log_in_first_to_add_to_cart": "يرجى تسجيل الدخول أولاً لإضافة المنتج إلى السله",
    "product_added_to_cart": "تمت إضافة المنتج إلى السله",
    "failed_to_add_to_cart": "فشل في الإضافة إلى السله",
    "product_deleted_successfully": "تم حذف المنتج بنجاح",
    "failed_to_delete_product": "فشل في حذف المنتج",
    "payment_successful": "تم الدفع بنجاح",
    "checkout_error": "خطأ في الطلب",
    "auth_required": "مطلوب تسجيل الدخول",
    "failed_to_process_checkout": "فشل إتمام عملية الدفع",
    "rating_submitted": "تم تقييم المنتج بنجاح",
    "rating_failed": "فشل تقييم المنتج",
    "please_log_in_first_to_rate_product": "يرجى تسجيل الدخول أولاً لتقييم المنتج"
  },
  "product": {
    "save": "توفير",
    "description": "الوصف",
    "quantity": "كمية:",
    "available": "متوفر",
    "filter_options": "خيارات التصفية",
    "categories": "الفئات",
    "price_range": "السعر",
    "min_price": "من",
    "max_price": "الي",
    "no_products_found": "لم يتم العثور على أي منتجات",
    "ratings": "تقييمات",
    "customer_reviews": "آراء العملاء",
    "no_reviews_yet": "لا توجد آراء للعملاء حتى الآن",
    "anonymous": "مجهول"
  },
  "checkout": {
    "delivery_details": "تفاصيل التسليم",
    "payment": "المدفوعات",
    "payment_on_delivery": "الدفع عند التسليم",
    "payment_processing_fee": "رسوم معالجة الدفع",
    "credit_card": "بطاقة إئتمان",
    "pay_with_your_credit_card": "ادفع ببطاقتك الائتمانية",
    "total": "المجموع",
    "shipping": "شحن",
    "subtotal": "المجموع الفرعي",
    "savings": "التوفير"
  },
  "footer": {
    "your_trusted_partner_for_quality_services": "شريكك الموثوق به للخدمات عالية الجودة",
    "contact_us": "اتصل بنا",
    "get_in_touch": "تواصل معنا",
    "all_rights_reserved": "جميع الحقوق محفوظة.",
    "pyramids_gardens": "حدائق الأهرام",
    "gize": "الجيزة",
    "egypt": "مصر",
    "exchange_and_return_policy": "سياسة الاستبدال و الاسترجاع",
    "shipping_policy": "سياسة الشحن",
    "terms_of_use": "شروط الاستخدام",
    "exchange_policy_point_one": "الإستبدال والإسترجاع حق مضمون لكل عملائنا وهو يشمل جميع المنتجات التي نعرضها على متجرنا.",
    "exchange_policy_point_two": "في حالة وجود اي عيب في المنتج برجاء التواصل معنا من خلال الواتساب.",
    "exchange_policy_point_three": "يمكن الإرجاع أو الإستبدال إذا كان المنتج بنفس حالته الأصلية عند الشراء ومغلفا بالغلاف الأصلي.",
    "exchange_policy_point_four": "يتم الموافقة على طلب الاستبدال او الاسترجاع خلال يومين عمل.",
    "exchange_policy_point_five": "في حالة الموافقة على طلب الاسترجاع والاستبدال المندوب يصل للعميل خلال 3-4 أيام عمل.",
    "shipping_policy_content": "بعد تأكيد عملية الشراء، نقوم بإرسال المنتج إلى شركة الشحن وتقوم شركة الشحن بالإتصال بكم لتأكيد ميعاد ومكان الإستلام ويتم إرسال المندوب فور التأكيد خلال 1-2 أيام للقاهرة والجيزة و2-5 أيام للمحافظات.",
    "terms_of_use_title_one": "المقدمة",
    "terms_of_use_content_one": "تنطبق شروط الاستخدام على الموقع وعلى جميع أقسامها وفروعها ومواقع الإنترنت التابعة لها التي تُشير إلى هذه الشروط والأحكام كمرجعٍ لها.",
    "terms_of_use_content_two": "تنطبق شروط الاستخدام على الموقع وعلى جميع أقسامها وفروعها ومواقع الإنترنت التابعة لها التي تُشير إلى هذه الشروط والأحكام كمرجعٍ لهعند زيارة الموقع، يقر العميل موافقته على الشروط والأحكام الحالية. وإن كنت لا توافق عليها، فعليك عدم استخدام هذا الموقع. ويحتفظ القائمون على الموقع بالحق في تغيير أجزاء من شروط الاستخدام والأحكام أو تعديلها أو إضافة معلومات إليها، أو إزالتها في أي وقت. وتصبح التغييرات سارية النفاذ عندما يتم نشرها على الموقع دون سابق إشعار. ويُرجى مراجعة شروط الاستخدام والأحكام بانتظام للاطلاع على أي تحديثات. ويشكِّل استخدامك المستمر للموقع ــ بعد نشر التغييرات الحادثة في هذه الشروط والأحكام الخاصة بالاستخدام ــ موافقتك التامة على تلك التغييرات",
    "terms_of_use_title_two": "استخدام الموقع",
    "terms_of_use_content_three": "لزيارة هذا الموقع، يجب ألا يقل عمرك عن 18 عامًا أو أن تزور الموقع تحت إشراف أحد الوالدين أو الوصي القانوني.",
    "terms_of_use_content_four": "ونمنحك ترخيصًا غير قابل للتحويل أو الإلغاء لكي تستخدم الموقع بموجب الشروط والأحكام المحدَّدة. وتكمن غاية هذا الترخيص في التسوُّق لشراء سلعٍ شخصية تُباع على الموقع. ويُحظر الاستخدام لأغراض تجارية أو الاستخدام باسم أي طرف ثالث، باستثناء ما تمَّ السماح به من قبلنا بوضوح وشفافية سلفًا. ويؤدِّي أي خرق لهذه الشروط والأحكام إلى إلغاء فوري للترخيص الممنوح في هذه الفقرة من دون أي سابق إنذار لك",
    "terms_of_use_content_five": "Tيتم عرض المحتوى الظاهر على هذا الموقع لأغراض إعلامية فقط. وتعود التوضيحات التي تخُص المنتجات والتي أُعرب عنها في هذا الموقع إلى البائعين أنفسهم وليس لنا فيها أي شأن. وترجع التعليقات أو الآراء الواردة على هذا الموقع إلى الجهة التي نشرتها وبالتالي لا تعكس آراءنا.",
    "terms_of_use_content_six": "تتطلب بعض الخدمات والميزات ذات الصلة التي قد تكون متوفرة على الموقع التسجيل أو الاشتراك فيها. وباختيارك التسجيل أو الاشتراك في أيّ من هذه الخدمات أو الميزات ذات الصلة، فإنَّك توافق على تقديم معلومات دقيقة وحالية عن نفسك وعلى تحديثها في الوقت المناسب إذا طرأت أيّة تغييرات عليها. ويتحمَّل كُلّ مستخدم للموقع ــ وحده ــ مسؤولية حفظ كلمات السر وغيرها من أساليب تحديد حساب الاستخدام بطريقة سليمة. وتقع كامل المسؤولية على عاتق صاحب الحساب بالنسبة فيما يخص جميع الأنشطة التي تحدث باستخدام كلمة السر الخاصة به أو حسابه. بالإضافة إلى ذلك، عليك تبليغنا عن أي استخدام غير مصرَّح به لكلمة السر أو حسابك. ولا يُعد الموقع مسؤولاً في أي حال من الأحوال، بشكل مباشر أو غير مباشرٍ أو بأي شكل من الأشكال، عن أيّة خسارة أو أضرار من أي نوع، قد تنتُج عن تعثرك في الامتثال لهذا القِسم أو تتصل به.",
    "terms_of_use_content_seven": "وأثناء عملية التسجيل، يوافق العميل على تلقِّي رسائل إلكترونية ترويجية من قِبل الموقع. ويمكنك، في وقت لاحق، إلغاء هذا الخيار وعدم تلقي أي رسائل إلكترونية ترويجية من خلال الضغط على الرابط الموجود في الجزء السفلي من أية رسالة إلكترونية ترويجية.",
    "terms_of_use_title_three": "مشاركات المستخدم",
    "terms_of_use_content_eight": "إنّ كلّ مشاركاتك على الموقع و/أو ما تقدمه لنا، بما في ذلك ــ على سبيل المثال وليس الحصرــ الأسئلة والانتقادات والتعليقات والاقتراحات (مجتمعين في لفظة “المشاركات”) تصبح ملكنا الوحيد والحصري، ولا تعود بأي حالٍ من الأحوال ملكاً لك. وفضلاً عن الحقوق التي تنطبق على أي نوع من المشاركات، وبمجرَّد أنَّك تشاركنا بتعليقاتك أو انتقاداتك على الموقع، فإنَّك تمنحنا أيضاً حقّ استخدام الاسم الذي تعرضه والمرتبط مباشرةً بهذا النقد أو التعليق أو أي محتوى آخر. ولا يحق لك استخدام عنوان مزيَّف للبريد الإلكتروني أو الادِّعاء بأنّك شخصٌ آخر أو محاولة تضليلنا أو أي طرف ثالث فيما يتعلَّق بأصالة وموثوقيّة أي من المشاركات. ويجوز لنا حذف أيّ من المشاركات أو تعديلها، غير أننا لسنا ملزمين بذلك.",
    "terms_of_use_title_four": "الموافقة على الطلبات وتفاصيل الأسعار",
    "terms_of_use_content_nine": "يُرجى الملاحظة أنّه في بعض الحالات، قد لا تتم الموافقة على طلب ما لعدَّة أسباب. ويحتفظ القائمون على الموقع بالحقّ في رفض أو إلغاء أي طلب لأي سببٍ من الأسباب وفي أي وقت. وقبل أن نوافق على الطلب، قد نطلب منك تقديم معلومات إضافية أو بيانات أخرى للتحقق من شيء ما، بما في ذلك ــ على سبيل المثال وليس الحصر، رقم الهاتف والعنوان.",
    "terms_of_use_content_ten": "ونحرص على توفير أدق المعلومات المتعلقة بالأسعار لجميع المستخدمين الذين يزورون الموقع. إلّا أنَّ الأخطاء قد تَرِدُ في بعض الأحيان، كالحالات التي لا يتمّ فيها تحديد سعر المنتج بشكلٍ صحيحٍ على الموقع. ومن ثمّ، فنحتفظ بالحقّ في رفض أو إلغاء أي طلب من الطلبات. وفي حالة ما إذا لم يتم تحديد سعر المنتج بشكلٍ صحيح، فيحق لنا، وفقًا لتقديرنا الخاص، الاتصال بك للحصول على تعليماتٍ أو إلغاء طلبك وإبلاغك بهذا الإلغاء. ولنا الحق في رفض أو إلغاء أي طلبات سواء تمّ تأكيدها أو لا وبعد إضافة الرسوم على بطاقة الائتمان.",
    "terms_of_use_title_five": "العلامات التجارية وحقوق النشر",
    "terms_of_use_content_eleven": "إنَّ جميع حقوق الملكية الفكرية، سواء كانت مسجلَّة أو غير مسجلَّة، في الموقع، وجميع معلومات المحتوى والتصميمات الواردة على الموقع، تُعتبر ملكاً لنا، بما في ذلك على سبيل المثال وليس الحصر، النصوص والرسوم والبرامج والصور والفيديو والموسيقى والصوت، واختيارها وتنسيقها، فضلاً عن جميع مصنّفات البرمجيات ورموز المصادر والبرامج الرئيسية. وإنّ كلّ محتويات الموقع محميةٌ أيضًا بموجب حقوق النشر مجتمعة في صورة عمل واحد. جميع الحقوق محفوظة.",
    "terms_of_use_title_six": " القانون السائد والهيئات القضائية",
    "terms_of_use_content_twelve": "تُفسَّر هذه الشروط والأحكام وتُطبَّق بموجب القوانين السارية في البلد. وبموجب ذلك، يوافق كل طرف على المثول أمام هيئات المحاكم القضائية في البلد والتنازل عن أية اعتراضات تتعلق بالمكان.",
    "terms_of_use_title_seven": "إلغاء الموافقة",
    "terms_of_use_title_thirteen": "بالإضافة إلى أي أحكام قانونية أو إجراءات الإنصاف القضائي، يجوز لنا، فورًا ومن دون سابق إنذار لك، إنهاء هذه الشروط والأحكام أو نلغي أيا من حقوقك الممنوحة أو جميعها بموجب الشروط والأحكام. وفي أي حالة لإنهاء هذا التعاقد، يتعيّن عليك التوقّف فورًا عن زيارة الموقع واستخدامه، وفضلاً عن إصدار أحكام قانونية أو إجراءات منصفة قضائيًا، قد نُلغي فورًا جميع كلمات السرّ أو غيرها من أساليب تعريف الحساب الممنوحة لك، ونرفض أي زيارة أو استخدام لهذا الموقع كلّيًا أو جزئيًا. ولن يؤثِّر أي إبطال لهذا الاتفاق في جميع الحقوق والالتزامات (بما في ذلك ولكن ليس على سبيل الحصر، التزامات الدفع) الخاصة بالأطراف والصادرة قبل تاريخ إنهاء التعاقد. ومن ثمّ، فتوافق على أنَّ القائمين على الموقع لن يتحملوا المسؤولية عنك أو عن أيّ فرد آخر نتيجة لتعليق الخدمة أو إنهائها. وإذا كنتَ غير راضٍ عن هذا الموقع أو عن أي من الشروط أو الأحكام أو النظام أو السياسات أو المبادئ التوجيهية أو الممارسات الخاصة بمتجر في كيفيّة إدارة المتجر، فالإجراء الوحيد والحصري الذي عليك اتخاذه عندئذٍ هو التوقُّف عن استخدام الموقع."
  }
}
