{
  "layout": {
    "home": "Home",
    "all_products": "All Products",
    "hot_deals": "Hot deals",
    "contact_us": "Contact Us",
    "market_with_us": "Market with us"
  },
  "home": {
    "home_page": "Home Page",
    "elevate_your_kitchen_essentials": "Elevate Your Kitchen Essentials",
    "shop_our_curated_collection_of_compact_blenders_kettles_toasters_and_more_designed_for_performance_and_style": "Shop our curated collection of compact blenders, kettles, toasters and more—designed for performance and style.",
    "shop_by_brand": "Shop by Brand",
    "hot_deals": "Hot Deals"
  },
  "form": {
    "full_name": "Full name",
    "enter_your_full_name": "Enter your full name",
    "email": "Email (optional)",
    "enter_your_email": "Enter your email",
    "country": "Country",
    "governorate": "Governorate",
    "phone_number": "Phone number",
    "whatsapp_number": "Whatsapp number",
    "full_address": "Full address",
    "enter_your_full_address_here": "Enter your full address here (region/center/street name/property number)",
    "your_full_address": "Your full address",
    "search_for_product": "Search for product..."
  },
  "meta": {
    "home": "Home",
    "all_products": "All Products",
    "hot_deals": "Hot deals",
    "contact_us": "Contact Us",
    "page_not_found": "Page not found",
    "shopping_cart": "Shopping cart",
    "checkout": "Checkout",
    "order_summary": "Order summary",
    "exchange_and_return_policy": "Exchange and Return Policy",
    "shipping_policy": "Shipping Policy",
    "terms_of_use": "Terms of Use"
  },
  "countries_menu": {
    "egypt": "Egypt",
    "ksa": "Ksa"
  },
  "cart": {
    "your_cart_is_currently_empty": "Your cart is currently empty",
    "continue_shopping": "Continue shopping",
    "total": "Total",
    "your_cart": "Your Cart",
    "category": "Category:",
    "discount": "Discount:",
    "available": "Available",
    "subtotal": "Subtotal",
    "shipping": "Shipping",
    "including_vat": "including VAT",
    "qty": "Quantity:",
    "order_summary": "Order summary"
  },
  "btn": {
    "checkout_now": "Checkout now",
    "view_cart": "View cart",
    "add_to_cart": "Add to cart",
    "login_with_google": "Login with Google",
    "delete": "Delete",
    "checkout": "Checkout",
    "place_order": "Place order",
    "please_wait": "Please wait",
    "view_order_summary": "View order summary",
    "see_more_products": "See more Products"
  },
  "order_summary": {
    "order_summary": "Order summary",
    "order_number": "Order number",
    "price": "Price",
    "orignal_price": "Orignal price",
    "subtotal": "Subtotal",
    "savings": "Savings",
    "total": "Total",
    "quantity": "Quantity:",
    "no_order_data": "No orders right now",
    "shipping": "Shipping"
  },
  "toast": {
    "please_log_in_first_to_add_to_cart": "Please log in first to add to cart",
    "product_added_to_cart": "Product added to cart",
    "failed_to_add_to_cart": "Failed to add to cart",
    "product_deleted_successfully": "Product deleted successfully",
    "failed_to_delete_product": "Failed to delete product",
    "payment_successful": "Payment successful",
    "checkout_error": "Checkout error",
    "auth_required": "Auth required",
    "failed_to_process_checkout": "Failed to process checkout",
    "rating_submitted": "The product has been successfully evaluated.",
    "rating_failed": "Product evaluation failed",
    "please_log_in_first_to_rate_product": "Please log in first to rate product"
  },
  "product": {
    "save": "Save",
    "description": "Description",
    "quantity": "Quantity:",
    "available": "Available",
    "filter_options": "Filter options",
    "categories": "Categories",
    "price_range": "Price",
    "min_price": "From",
    "max_price": "To",
    "no_products_found": "No products found",
    "ratings": "Ratings"
  },
  "checkout": {
    "delivery_details": "Delivery Details",
    "payment": "Payment",
    "payment_on_delivery": "Payment on delivery",
    "payment_processing_fee": "payment processing fee",
    "credit_card": "Credit Card",
    "pay_with_your_credit_card": "Pay with your credit card",
    "total": "total",
    "shipping": "Shipping",
    "subtotal": "Subtotal",
    "savings": "Savings"
  },
  "footer": {
    "your_trusted_partner_for_quality_services": "Your trusted partner for quality services",
    "contact_us": "Contact Us",
    "get_in_touch": "Get in Touch",
    "all_rights_reserved": "All rights reserved.",
    "pyramids_gardens": "Pyramids Gardens",
    "gize": "Giza",
    "egypt": "Egypt",
    "exchange_and_return_policy": "Exchange and Return Policy",
    "shipping_policy": "Shipping Policy",
    "terms_of_use": "Terms of Use",
    "exchange_policy_point_one": "Exchange and return are a guaranteed right for all our customers, and this includes all products we offer in our store.",
    "exchange_policy_point_two": "In case of any defect in the product, please contact us via WhatsApp",
    "exchange_policy_point_three": "The product can be returned or exchanged if it is in the same condition as when purchased and in its original packaging.",
    "exchange_policy_point_four": "The exchange or return request will be approved within 2 working days.",
    "exchange_policy_point_five": "In case the return or exchange request is approved, the representative will reach the customer within 2-4 working days.",
    "shipping_policy_content": "After confirming your purchase, we send the product to the shipping company, which will then contact you to confirm the pickup date and location. A representative will be dispatched immediately upon confirmation within 1-2 days for Cairo and Giza, and 2-5 days for other governorates.",
    "terms_of_use_title_one": "The introduction",
    "terms_of_use_content_one": "These Terms of Use apply to the Site and all of its divisions, subsidiaries, and affiliated websites that reference these Terms and Conditions.",
    "terms_of_use_content_two": "By visiting the Site, you agree to the current Terms and Conditions. If you do not agree to them, you should not use this Site. The Site administrators reserve the right to change, modify, add, or remove portions of these Terms and Conditions of Use at any time. Changes will be effective when posted on the Site without prior notice. Please review the Terms and Conditions of Use regularly for updates. Your continued use of the Site following the posting of changes to these Terms and Conditions of Use constitutes your acceptance of those changes.",
    "terms_of_use_title_two": "Use of the Site",
    "terms_of_use_content_three": "To visit this Site, you must be at least 18 years of age or visit the Site under the supervision of a parent or legal guardian.",
    "terms_of_use_content_four": "We grant you a non-transferable, non-revocable license to use the Site under the Terms and Conditions described. This license is for the purpose of shopping for personal items sold on the Site. Commercial use or use on behalf of any third party is prohibited, except as expressly permitted by us in advance. Any breach of these Terms and Conditions shall result in the immediate revocation of the license granted in this paragraph without prior notice to you.",
    "terms_of_use_content_five": "The content appearing on this site is for informational purposes only. Product representations made on this site are those of the vendors themselves and are not ours. Comments or opinions expressed on this site are those of the individual posting them and do not reflect our views.",
    "terms_of_use_content_six": "Certain services and related features that may be made available on the Site may require registration or subscription. By choosing to register or subscribe for any such services or related features, you agree to provide accurate and current information about yourself and to promptly update such information if there are any changes. Every user of the Site is solely responsible for keeping passwords and other account identifiers safe and secure. The account owner is entirely responsible for all activities that occur under such password or account. In addition, you must notify us of any unauthorized use of your password or account. The Site shall not be responsible or liable, directly or indirectly, in any way for any loss or damage of any kind incurred as a result of, or in connection with, your failure to comply with this section.",
    "terms_of_use_content_seven": "During the registration process, the customer agrees to receive promotional emails from the site. You can later opt out of receiving any promotional emails by clicking the link at the bottom of any promotional email.",
    "terms_of_use_title_three": "User posts",
    "terms_of_use_content_eight": "All of your contributions to the Site and/or submissions to us, including, but not limited to, questions, reviews, comments, become our sole and exclusive property and shall not be returned to you. In addition to the rights applicable to any Submission, by submitting your comments or reviews to the Site, you also grant us the right to use the name you submit in connection with such review, comment, or other content. You may not use a false email address, pretend to be someone other than yourself, or otherwise mislead us or any third party as to the authenticity of any Submission. We may, but are not obligated to, remove or edit any Submission.",
    "terms_of_use_title_four": "Order approval and pricing details",
    "terms_of_use_content_nine": "Please note that in some cases, an order may not be accepted for various reasons. The site administrators reserve the right to refuse or cancel any order for any reason at any time. Before we accept the order, we may ask you to provide additional information or other data to verify something, including, but not limited to, your phone number and address.",
    "terms_of_use_content_ten": "We strive to provide the most accurate pricing information to all users who visit the site. However, errors may occasionally occur, such as when the price of a product is not displayed correctly on the site. Therefore, we reserve the right to refuse or cancel any order. In the event that an item is mispriced, we may, at our sole discretion, either contact you for instructions or cancel your order and notify you of such cancellation. We reserve the right to refuse or cancel any orders whether or not they have been confirmed and your credit card has been charged.",
    "terms_of_use_title_five": "Trademarks and Copyrights",
    "terms_of_use_content_eleven": "All intellectual property rights, whether registered or unregistered, in the Site, and all content and design information contained on the Site, are our property, including, but not limited to, text, graphics, software, photos, video, music, sound, and their selection and arrangement, as well as all software compilations, underlying source code, and software. The entire contents of the Site are also protected by copyright as a collective work. All rights reserved.",
    "terms_of_use_title_six": "Prevailing law and judicial bodies",
    "terms_of_use_content_twelve": "These Terms and Conditions shall be construed and governed by the laws of the country. Each party hereby agrees to submit to the jurisdiction of the courts of the country and waives any objections based on venue.",
    "terms_of_use_title_seven": "Cancel consent",
    "terms_of_use_title_thirteen": "In addition to any legal or equitable remedies, we may, immediately and without prior notice to you, terminate these Terms and Conditions or revoke any or all of your rights granted under the Terms and Conditions. Upon termination of this Agreement, you must immediately cease accessing and using the Site. In addition to any legal or equitable remedies, we may immediately revoke all passwords or other account identification issued to you and deny you access to and use of this Site in whole or in part. Any termination of this Agreement will not affect any and all rights and obligations (including, but not limited to, payment obligations) of the parties arising prior to the date of termination. You agree that the Site operators will not be liable to you or any other person as a result of any suspension or termination of service. If you are dissatisfied with this Site or with any of the terms, conditions, rules, policies, guidelines, or practices of the Store in operating the Store, your sole and exclusive remedy is to discontinue using the Site."
  }
}
